{
    // Default dialogue (overridden by individual characters)
    "default.FeedTheAnimals": "Good morning {{nickName}}, I fed all of the animals today.",
    "default.FeedThePet": "Good morning {{nickName}}, I filled {{petName}}'s water bowl.",
    "default.GiveAGift":  "Good morning {{nickName}}, I got you this {{itemName}}. I hope it helps you out today.{{itemId}}",
    "default.GiveAGift.cooking":  "Good morning {{nickName}}, I made you a {{itemName}} for breakfast this morning. I hope you enjoy it!{{itemId}}",
    "default.GiveAGift.birthday.her": "It's {{npcName}}'s birthday today! I went and bought a gift for you to give to her.{{itemId}}",
    "default.GiveAGift.birthday.him": "It's {{npcName}}'s birthday today! I went and bought a gift for you to give to him.{{itemId}}",
    "default.PetTheAnimals": "Good morning {{nickName}}, I pet all of the animals in the barn and coop.",
    "default.RepairTheFences": "Good morning {{nickName}}, I repaired some of the fences.",
    "default.WaterTheCrops": "Good morning {{nickName}}, I watered the crops for you today.",
    "default.WaterTheSlimes": "Good morning {{nickName}}, I filled the slimes troughs with water.",
    // Shane dialogue (credit: alekrrau)
    "Shane.FeedTheAnimals": "Hey {{nickName}}, I fed all the animals already. Heh, you should've seen how {{animalName}} went to town on breakfast.",
    "Shane.FeedThePet": "If {{petName}} tries to con you, I already filled their bowl. No matter how much they whine or how cute and sad they look you can't fall for it.",
    "Shane.PetTheAnimals.1": "Morning {{nickName}}. I got up early and I've visited all the chickens, and the other animals too. Gave 'em all plenty of attention. Can't believe that's even a chore we have to do, it's one of the best parts of my day! Besides you, of course.",
    "Shane.PetTheAnimals.2": "Today's just one of my heavier days... So I went around and visited all the animals. Yeah, I'm feeling a bit better, petting them always cheers me up.",
    "Shane.PetTheAnimals.3": "I took {{childName}} around the farm today to pet all the animals with me. It was so cute, I should've taken pictures.",
    "Shane.RepairTheFences": "Hey {{playerName}}, I walked around and fixed some fences that were falling down. What? Yeah, it might not be my specialty, but I know how. Who do you think had to fix all the broken light builbs and shelves at Joja?",
    "Shane.WaterTheCrops": "Hey, I actually had a burst of productivity today, and I watered all the crops. Fresh air was nice.",
    "Shane.WaterTheSlimes.1": "Hang on, I gotta chance- I just watered the slimes and they got me all goopy. Eh, they're not that scary, I just try to envision them as chickens- gross, multiplying, angry chickens that don't want to be pet, and try to fight me the instant they see me.",
    "Shane.WaterTheSlimes.2": "Wait! Don't hug me yet, I just got back from the slime pen. Game them water, so you don't have to go back in there for another day. I'm gonna go shower- unless you'd like to join me?",
    "Shane.WaterTheSlimes.3": "Do you think slimes can recognize people? Because I just gave them water, and I swear they have developed a specific vendetta against me in particular.",
    "Shane.WaterTheSlimes.4": "{{playerName}}! I moistened the slimes and made it back alive. Do I get a kiss for being brave?",
    "Shane.WaterTheSlimes.5": "I filled the slimes water troughs. Don't worry about it, I might not be an adventurer like you, but I know how to handle aggresive, slimy, mindless monsters. What? No, I'm not talking about the slimes, I'm talking about the Joja Customers I used to deal with. Slimes aren't nearly as bad.",
    // Emily dialogue (credit: alekrrau)
    "Emily.FeedTheAnimals": "Good morning {{nickName}}! I've fed all the animals.",
    "Emily.FeedThePet": "I was filling {{petName}}'s water bowl today, and they were being so sweet! They really are like a member of the family, don't you think?",
    "Emily.PetTheAnimals": "I pet all the animals this morning- they have such pure souls. I think a lot of humans forget how much they can learn from animals, don't you? I can see wisdom in their eyes that I may never understand.",
    "Emily.RepairTheFences": "Oh, {{playerName}}! Some of the fences were falling down so I replaced them. They won't need repair for a little while.",
    "Emily.WaterTheCrops": "The crops looks so happy this morning when I went to water them. They love the soil here, I can tell.",
    "Emily.WaterTheSlimes.1": "I just filled the water for the slime hutch! Oh no, {{playerName}}, even when they attack us it doesn't upset me. They're just doing what is instinct for them. It's part of their nature, and there's nothing wrong with that, even if we don't understand it.",
    "Emily.WaterTheSlimes.2": "I know they're a bit dangerous, but I think slimes are so beautiful. When light passes through their bodies, they remind me of gemstones!",
    "Emily.WaterTheSlimes.3": "I gave the slimes water again. Even though they seem less complex than other farm animals, they still deserve respect like any other creature. We all live on the same planet, after all.",
    // Krobus dialogue
    "Krobus.WaterTheSlimes":  "I like visiting the slimes, they remind me of the sewers.",
    "Krobus.GiveAGift.Cooking": "Umm... I found this food lying around. I thought you might like it...{{itemId}}"
}